
#include <iostream>

using namespace std;

int main()
{
    //===================================================================================================================================================================
    /* 1. Написать программу, вычисляющую выражение a* (b + (c / d)) и выводящую результат с плавающей точкой, где a, b, c, d – целочисленные константы.
    Используйте static_cast или СStyle cast к float чтобы выполнить точное деление.*/
    //===================================================================================================================================================================


    {
        unsigned int a = 15, b = 85, c = 96, d = 17;
        float y = a * (b + (static_cast<float>(c) / d));
        cout << y << endl;
        return 0;
    }

    //=================================================================================================================================================================
    /* 2. Дано целое число. Если оно меньше или равно 21, то выведите на экран разницу между этим числом и числом 21. Если же заданное число больше, чем 21,
    необходимо вывести удвоенную разницу между этим числом и 21. При выполнении задания следует использовать тернарный оператор (?:).*/
    //=================================================================================================================================================================


    {
        int i, j;
        i = 30
            j = (i <= 21) ? (21 - i) : 2 * (i - 21);
        cout << j << endl;
        return 0;
    };

    //=================================================================================================================================================================
    /* 3. Описать трёхмерный целочисленный массив, размером 3х3х3 и указатель на значения внутри массива и
    при помощи операции разыменования вывести на экран значение центральной ячейки получившегося куба [1][1][1].*/
    //=================================================================================================================================================================



    {
        int Array[3][3][3] = { { {991, 992, 993}, {881, 882, 883}, {771, 772, 773} },
                          { {661, 662, 663}, {551, 552, 553}, {441, 442, 443} },
                          { {331, 332, 333}, {221, 222, 223}, {111, 112, 113} } },
        * pArr;
        pArr = &Array[1][1][1];
        *pArr = 30;
        cout << Array[1][1][1] << endl;
        return 0;
    };



    //=================================================================================================================================================================
    // 4. Написать программу, вычисляющую выражение из первого задания, а переменные для неё объявлены и инициализировать в другом cpp файле. Используйте extern.
    //=================================================================================================================================================================
    
extern int a; 
extern int b;
extern int c;
extern int d;

    {
        int a, b, c, d;
        float y = a * (b + (static_cast<float>(c) / d));
        cout << y << endl;
        return 0;
    }

};



