#include <iostream>
using namespace std;

//=====================================================================================================================================================================
/* 1. Написать программу, проверяющую что сумма двух (введенных с клавиатуры) чисел лежит в пределах от 10 до 20 (включительно), 
если да – вывести строку "true", в противном случае – "false";*/
//=====================================================================================================================================================================

void task1()
{
    int num1, num2;
    cout << "Enter number 1" << endl;
    cin >> num1;
    cout << "Enter number 2" << endl;
    cin >> num2;
    const int answer = num1 + num2;
    
    if (answer >=10 && answer <=20)
    {
        cout << answer << " true" << endl;
    }
    else 
    {
        cout << answer << " false" << endl;
        
    }
}

//=====================================================================================================================================================================
/* 2. Написать программу, выводящую на экран строку “true”, если две целочисленные константы, 
объявленные в её начале либо обе равны десяти сами по себе, либо их сумма равна десяти. Иначе "false".*/
//=====================================================================================================================================================================

void task2()
{
    const int a = 12;
    const int b = 10;

    if ((a == 10 && b == 10) && (a + b == 10))

    {
        cout << "true" << endl;
    }

    else
    {
        cout << "false" << endl;
    }
}

//=====================================================================================================================================================================
/* 3. Написать программу которая выводит на экран список всех нечетных чисел он 1 до 50. Например: "Your numbers: 1 3 5 7 9 11 13 …". 
Для решения используйте любой С++ цикл.*/
//=====================================================================================================================================================================

void task3()

{
    const size_t ODD = 50;
    for (size_t i= 1; i < ODD; i++)
    {
        cout << i++ << endl;
    }
}

//======================================================================================================================================================================
/* 4. Со звёздочкой. Написать программу, проверяющую, является ли некоторое число - простым. Простое число — это целое положительное число, 
которое делится без остатка только на единицу и себя само.*/
//======================================================================================================================================================================

void task4()

{
    setlocale(LC_ALL, "Russian");
    srand(time(0));
    short int n = rand();
    for (int i = 2; i <= n; ++i)
    {
        if (n % i == 0)
        {
            cout << n << "-" << "Не простое" << endl;
        }
        else
        {
            cout << n << "-" << "Простое" << endl;
            break;
        }
    }
}

//======================================================================================================================================================================
/* 5. Со звёздочкой. Пользователь вводит с клавиатуры число (год): от 1 до 3000. Написать программу, которая определяет является ли этот год високосным. 
Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный. Вывести результаты работы программы в консоль.*/
//======================================================================================================================================================================

void task5()

{
    setlocale(LC_ALL, "Russian");
    int LeapYear;
    cout << "Введите число " << endl;
    cin >> LeapYear;
    if (LeapYear > 1 && LeapYear < 3000)
    {
        if (LeapYear % 4 == 0 && LeapYear % 100 != 0)
        {
            if (LeapYear % 400 == 0) // вот здесь программа ломается, до этого работает корректно по условию, не могу понять почему и как дальше
            {
                cout << LeapYear << "-" << "Високосный год" << endl;
            }
            else
            {
                cout << LeapYear << "-" << "Не високосный год" << endl;
            }
        }
        else
        {
            cout << LeapYear << "-" << "Не високосный год" << endl;
        }

    }
    else
    {
        cout << "false" << endl;
    }
}