// ConsoleApplication1.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>

// ====================================================================================================================================================================
// Задание №1. Создать и инициализировать переменные пройденных типов данных (short int, int, long long, char, bool, float, double).
// ====================================================================================================================================================================

short int i;
i = 60000;

int j = 1500000;

long long AAA = 3693693693693;

char ch1 = 69;

bool b;
b = false;

double x;
x = 5.16;

float D = 3.12f;

//====================================================================================================================================================================
// Задание №2. Создать перечисление (enum) с возможными вариантами символов для игры в крестики-нолики.
//====================================================================================================================================================================

enum KrestikNolik

{
	cross = 'X',
	zero = '0',
	empty = '_'
};

// ==================================================================================================================================================================
// Задание №3. Создать массив, способный содержать значения такого перечисления и инициализировать его.
// ==================================================================================================================================================================

KrestikNolik array[3][3] = { {empty, empty, empty},
							 {empty, empty, empty},
							 {empty, empty, empty}
};

//===================================================================================================================================================================
// Задание №4. Создать структуру (struct) данных «Поле для игры в крестики-нолики» и снабдить его всеми необходимыми свойствами (подумайте что может понадобиться).
//===================================================================================================================================================================

struct KrestikiNoliki 
{
	KrestikNolik array[3][3];
	unsigned long int Player1name, Player2name;
	KrestikNolik Player1, Player2;
	const unsigned int Fieldsize = 3;

};

//====================================================================================================================================================================
// Задание №5.
//===================================================================================================================================================================

union MyData 
{
	int MyInt;
	float MyFloat;
	char MayChar;
};

struct MyVariant
{
	MyData data;
	
	unsigned int isInt : 1;
	unsigned int isFloat : 1;
	unsigned int isChar : 1;

};

int main()
{
	MyVariant var;

	var.data.MyInt = 31692;
	var.isInt = 1;
	var.isChar = 0;
	var.isFloat = 0;

	std::cout << var.data.MyInt << std::endl;

	return 0;
};